apache/nuttx/arch/arm/src/tiva/hardware/tm4c129_syscontrol.h
/* System Control Register Bit Definitions **************************************************/
/* System Control Registers (System Control Offset) */

/* Device Identification 0 */

#define SYSCON_DID0_MINOR_SHIFT        0         /* Bits 0-7: Minor Revision of the device */
#define SYSCON_DID0_MINOR_MASK         (0xff << SYSCON_DID0_MINOR_SHIFT)
#  define SYSCON_DID0_MIN_0            (0 << SYSCON_DID0_MINOR_SHIFT) /* Initial device or revision */
#  define SYSCON_DID0_MIN_1            (1 << SYSCON_DID0_MINOR_SHIFT) /* First metal layer change */
#  define SYSCON_DID0_MIN_2            (2 << SYSCON_DID0_MINOR_SHIFT) /* Second metal layer change */
#define SYSCON_DID0_MAJOR_SHIFT        8         /* Bits 8-15: Major Revision of the device */
#define SYSCON_DID0_MAJOR_MASK         (0xff << SYSCON_DID0_MAJOR_SHIFT)
#  define SYSCON_DID0_MAJ_REVA         (0  << SYSCON_DID0_MAJOR_SHIFT) /* Revision A */
#  define SYSCON_DID0_MAJ_REVB         (1 << SYSCON_DID0_MAJOR_SHIFT)  /* Revision B */
#  define SYSCON_DID0_MAJ_REVC         (2 << SYSCON_DID0_MAJOR_SHIFT)  /* Revision C */
#define SYSCON_DID0_CLASS_SHIFT        16        /* Bits 16-23: Device Class */
#define SYSCON_DID0_CLASS_MASK         (0xff << SYSCON_DID0_CLASS_SHIFT)
#  define SYSCON_DID0_CLASS_TM4C123    (5 << SYSCON_DID0_CLASS_SHIFT) /* Tiva TM4C123x and TM4E123x */
#  define SYSCON_DID0_CLASS_TM4C129    (10 << SYSCON_DID0_CLASS_SHIFT) /* Tiva TM4C129-class */
#define SYSCON_DID0_VER_SHIFT          28        /* Bits 28-30: DID0 Version */
#define SYSCON_DID0_VER_MASK           (7 << SYSCON_DID0_VER_SHIFT)
#  define SYSCON_DID0_VER_1            (1 << SYSCON_DID0_VER_SHIFT) /* Second version of DID0 format */

/* Device Identification 1 */

#define SYSCON_DID1_QUAL_SHIFT         0         /* Bits 1-0: Qualification Status */
#define SYSCON_DID1_QUAL_MASK          (3 << SYSCON_DID1_QUAL_SHIFT)
#  define SYSCON_DID1_QUAL_ES          (0 << SYSCON_DID1_QUAL_SHIFT) /* Engineering Sample */
#  define SYSCON_DID1_QUAL_PP          (1 << SYSCON_DID1_QUAL_SHIFT) /* Pilot Production */
#  define SYSCON_DID1_QUAL_FQ          (2 << SYSCON_DID1_QUAL_SHIFT) /* Fully Qualified */
#define SYSCON_DID1_ROHS               (1 << 2)  /* Bit 2: RoHS-Compliance */
#define SYSCON_DID1_PKG_SHIFT          3         /* Bits 3-4: Package Type */
#define SYSCON_DID1_PKG_MASK           (3 << SYSCON_DID1_PKG_SHIFT)
#  define SYSCON_DID1_PKG_QFP          (1 << SYSCON_DID1_PKG_SHIFT) /* QFP package */
#  define SYSCON_DID1_PKG_BGA          (2 << SYSCON_DID1_PKG_SHIFT) /* BGA package */
#define SYSCON_DID1_TEMP_SHIFT         5         /* Bits 5-7: Temperature Range */
#define SYSCON_DID1_TEMP_MASK          (7 << SYSCON_DID1_TEMP_SHIFT)
#  define SYSCON_DID1_TEMP_C           (0 << SYSCON_DID1_TEMP_SHIFT) /* Commercial temperature */
#  define SYSCON_DID1_TEMP_I           (1 << SYSCON_DID1_TEMP_SHIFT) /* Industrial temperature */
#  define SYSCON_DID1_TEMP_E           (2 << SYSCON_DID1_TEMP_SHIFT) /* Extended temperature */
#  define SYSCON_DID1_TEMP_IE          (3 << SYSCON_DID1_TEMP_SHIFT) /* Industrial and extended */
#define SYSCON_DID1_PINCOUNT_SHIFT     13        /* Bits 13-15: Package Pin Count */
#define SYSCON_DID1_PINCOUNT_MASK      (7 << SYSCON_DID1_PINCOUNT_SHIFT)
#  define SYSCON_DID1_PINCNT_100       (2 << SYSCON_DID1_PINCOUNT_SHIFT)  /* 100-pin LQFP */
#  define SYSCON_DID1_PINCNT_64        (3 << SYSCON_DID1_PINCOUNT_SHIFT)  /* 64-pin LQFP */
#  define SYSCON_DID1_PINCNT_144       (4 << SYSCON_DID1_PINCOUNT_SHIFT)  /* 144-pin LQFP */
#  define SYSCON_DID1_PINCNT_157       (5 << SYSCON_DID1_PINCOUNT_SHIFT)  /* 157-pin BGA */
#  define SYSCON_DID1_PINCNT_128       (6 << SYSCON_DID1_PINCOUNT_SHIFT)  /* 128-pin TQFP */
#  define SYSCON_DID1_PINCNT_1212       (7 << SYSCON_DID1_PINCOUNT_SHIFT) /* 212-pin BGA */
#define SYSCON_DID1_PARTNO_SHIFT       16        /* Bits 16-23: Part Number */
#define SYSCON_DID1_PARTNO_MASK        (0xff << SYSCON_DID1_PARTNO_SHIFT)
#  define SYSCON_DID1_TM4C1294NCPDT    (31 << SYSCON_DID1_PARTNO_SHIFT) /* TM4C1294NCPDT */
#  define SYSCON_DID1_TM4C129XNCZAD    (50 << SYSCON_DID1_PARTNO_SHIFT) /* TM4C129XNCZAD */
#define SYSCON_DID1_FAM_SHIFT          24        /* Bits 24-27: Family */
#define SYSCON_DID1_FAM_MASK           (15 << SYSCON_DID1_FAM_SHIFT)
#  define SYSCON_DID1_FAM_TIVA         (0 << SYSCON_DID1_FAM_SHIFT)  /* Tiva  C family */
#define SYSCON_DID1_VER_SHIFT          28        /* Bits 28-31:  DID1 Version */
#define SYSCON_DID1_VER_MASK           (15 << SYSCON_DID1_VER_SHIFT)
  #define SYSCON_DID1_VER_1            (1 << SYSCON_DID1_VER_SHIFT) /* Second version of DID1 format */

/* Power-Temp Brown Out Control */

#define SYSCON_PTBOCTL_VDD_UBOR_SHIFT     (0)    /* Bits 0-1: VDD (VDDS) under BOR Event Action */
#define SYSCON_PTBOCTL_VDD_UBOR_MASK      (3 << SYSCON_PTBOCTL_VDD_UBOR_SHIFT)
#  define SYSCON_PTBOCTL_VDD_UBOR_NONE    (0 << SYSCON_PTBOCTL_VDD_UBOR_SHIFT) /* No Action */
#  define SYSCON_PTBOCTL_VDD_UBOR_SYSINT  (1 << SYSCON_PTBOCTL_VDD_UBOR_SHIFT) /* System control interrupt */
#  define SYSCON_PTBOCTL_VDD_UBOR_NMI     (2 << SYSCON_PTBOCTL_VDD_UBOR_SHIFT) /* NMI */
#  define SYSCON_PTBOCTL_VDD_UBOR_RST     (3 << SYSCON_PTBOCTL_VDD_UBOR_SHIFT) /* Reset */
#define SYSCON_PTBOCTL_VDDA_UBOR_SHIFT    (8)    /* Bits 8-9: VDDA under BOR Event Action */
#define SYSCON_PTBOCTL_VDDA_UBOR_MASK     (3 << SYSCON_PTBOCTL_VDDA_UBOR_SHIFT)
#  define SYSCON_PTBOCTL_VDDA_UBOR_NONE   (0 << SYSCON_PTBOCTL_VDDA_UBOR_SHIFT) /* No Action */
#  define SYSCON_PTBOCTL_VDDA_UBOR_SYSINT (1 << SYSCON_PTBOCTL_VDDA_UBOR_SHIFT) /* System control interrupt */
#  define SYSCON_PTBOCTL_VDDA_UBOR_NMI    (2 << SYSCON_PTBOCTL_VDDA_UBOR_SHIFT) /* NMI */
#  define SYSCON_PTBOCTL_VDDA_UBOR_RST    (3 << SYSCON_PTBOCTL_VDDA_UBOR_SHIFT) /* Reset */

/* Raw Interrupt Status */

#define SYSCON_RIS_BOR1RIS             (1 << 1)  /* Bit 1:  VDD under BOR1 Raw Interrupt Status */
#define SYSCON_RIS_BORRIS              (1 << 1)  /* Bit 1:  Brown-Out Reset Raw Interrupt Status */
#define SYSCON_RIS_MOFRIS              (1 << 3)  /* Bit 3:  Main Oscillator Failure Raw Interrupt Status */
#define SYSCON_RIS_PLLLRIS             (1 << 6)  /* Bit 6:  PLL Lock Raw Interrupt Status */
#define SYSCON_RIS_USBPLLLRIS          (1 << 7)  /* Bit 7:  USB PLL Lock Raw Interrupt Status */
#define SYSCON_RIS_MOSCPUPRIS          (1 << 8)  /* Bit 8:  MOSC Power Up Raw Interrupt Status */
#define SYSCON_RIS_VDDARIS             (1 << 10) /* Bit 10: VDDA Power OK Event Raw Interrupt Status */
#define SYSCON_RIS_BOR0RIS             (1 << 11) /* Bit 11: VDD under BOR0 Raw Interrupt Status */

