apache/nuttx/arch/arm/src/tiva/hardware/tm4c129_syscontrol.h
/* Interrupt Mask Control */

#define SYSCON_IMC_BOR1IM              (1 << 1)  /* Bit 1:  VDD under BOR1 Interrupt Mask */
#define SYSCON_IMC_BORIM               (1 << 1)  /* Bit 1:  Brown-Out Reset Interrupt Mask */
#define SYSCON_IMC_MOFIM               (1 << 3)  /* Bit 3:  Main Oscillator Failure Interrupt Mask */
#define SYSCON_IMC_PLLLIM              (1 << 6)  /* Bit 6:  PLL Lock Interrupt Mask */
#define SYSCON_IMC_USBPLLLIM           (1 << 7)  /* Bit 7:  USB PLL Lock Interrupt Mask */
#define SYSCON_IMC_MOSCPUPIM           (1 << 8)  /* Bit 8:  MOSC Power Up Interrupt Mask */
#define SYSCON_IMC_VDDAIM              (1 << 10) /* Bit 10: VDDA Power OK Interrupt Mask */
#define SYSCON_IMC_BOR0IM              (1 << 11) /* Bit 11: VDD under BOR0 Interrupt Mask */

/* Masked Interrupt Status and Clear */

#define SYSCON_MISC_BOR1MIS            (1 << 1)  /* Bit 1:  VDD under BOR1 Masked Interrupt Status */
#define SYSCON_MISC_BORMIS             (1 << 1)  /* Bit 1:  BOR Masked Interrupt Status */
#define SYSCON_MISC_MOFMIS             (1 << 3)  /* Bit 3:  Main Oscillator Failure Masked Interrupt Status */
#define SYSCON_MISC_PLLLMIS            (1 << 6)  /* Bit 6:  PLL Lock Masked Interrupt Status */
#define SYSCON_MISC_USBPLLLMIS         (1 << 7)  /* Bit 7:  USB PLL Lock Masked Interrupt Status */
#define SYSCON_MISC_MOSCPUPMIS         (1 << 8)  /* Bit 8:  MOSC Power Up Masked Interrupt Status */
#define SYSCON_MISC_VDDAMIS            (1 << 10) /* Bit 10: VDDA Power OK Masked Interrupt Status */
#define SYSCON_MISC_BOR0MIS            (1 << 11) /* Bit 11: VDD under BOR0 Masked Interrupt Status */

/* Reset Cause */

#define SYSCON_RESC_EXT                (1 << 0)  /* Bit 0:  External Reset */
#define SYSCON_RESC_POR                (1 << 1)  /* Bit 1:  Power-On Reset */
#define SYSCON_RESC_BOR                (1 << 2)  /* Bit 2:  Brown-Out Reset */
#define SYSCON_RESC_WDT0               (1 << 3)  /* Bit 3:  Watchdog Timer 0 Reset */
#define SYSCON_RESC_SW                 (1 << 4)  /* Bit 4:  Software Reset */
#define SYSCON_RESC_WDT1               (1 << 5)  /* Bit 5:  Watchdog Timer 1 Reset */
#define SYSCON_RESC_HIB                (1 << 6)  /* Bit 6:  HIB Reset */
#define SYSCON_RESC_HSSR               (1 << 12) /* Bit 12: HSSR Reset */
#define SYSCON_RESC_MOSCFAIL           (1 << 16) /* Bit 16: MOSC Failure Reset */

/* Power-Temperature Cause */

#define SYSCON_PWRTC_VDD_UBOR          (1 << 0)  /* Bit 0:  VDD Under BOR Status */
#define SYSCON_PWRTC_VDDA_UBOR         (1 << 4)  /* Bit 4:  VDDA Under BOR Status */

/* NMI Cause Register */

#define SYSCON_NMIC_EXTERNAL           (1 << 0)  /* Bit 0:  External Pin NMI */
#define SYSCON_NMIC_POWER              (1 << 2)  /* Bit 2:  Power/Brown Out Event NMI */
#define SYSCON_NMIC_WDT0               (1 << 3)  /* Bit 3:  Watch Dog Timer (WDT) 0 NMI */
#define SYSCON_NMIC_WDT1               (1 << 5)  /* Bit 5:  Watch Dog Timer (WDT) 1 NMI */
#define SYSCON_NMIC_TAMPER             (1 << 9)  /* Bit 9:  Tamper Event NMI */
#define SYSCON_NMIC_MOSCFAIL           (1 << 16) /* Bit 16: MOSC Failure NMI */

/* Main Oscillator Control */

#define SYSCON_MOSCCTL_CVAL            (1 << 0)  /* Bit 0:  Clock Validation for MOSC */
#define SYSCON_MOSCCTL_MOSCIM          (1 << 1)  /* Bit 1:  MOSC Failure Action */
#define SYSCON_MOSCCTL_NOXTAL          (1 << 2)  /* Bit 2:  No Crystal Connected */
#define SYSCON_MOSCCTL_PWRDN           (1 << 3)  /* Bit 3:  Power Down */
#define SYSCON_MOSCCTL_OSCRNG          (1 << 4)  /* Bit 4:  Oscillator Range */

/* Run and Sleep Mode Configuration Register */

#define SYSCON_RSCLKCFG_PSYSDIV_SHIFT   (0)       /* Bits 0-9:PLL System Clock Divisor */
#define SYSCON_RSCLKCFG_PSYSDIV_MASK    (0x3ff << SYSCON_RSCLKCFG_PSYSDIV_SHIFT)
#  define SYSCON_RSCLKCFG_PSYSDIV(n)    ((uint32_t)(n) << SYSCON_RSCLKCFG_PSYSDIV_SHIFT)
#define SYSCON_RSCLKCFG_OSYSDIV_SHIFT   (10)      /* Bits 10-19: Oscillator System Clock Divisor */
#define SYSCON_RSCLKCFG_OSYSDIV_MASK    (0x3ff << SYSCON_RSCLKCFG_OSYSDIV_SHIFT)
#  define SYSCON_RSCLKCFG_OSYSDIV(n)    ((uint32_t)(n) << SYSCON_RSCLKCFG_OSYSDIV_SHIFT)
#define SYSCON_RSCLKCFG_OSCSRC_SHIFT    (20)      /* Bits 20-23: Oscillator Source */
#define SYSCON_RSCLKCFG_OSCSRC_MASK     (15 << SYSCON_RSCLKCFG_OSCSRC_SHIFT)
#  define SYSCON_RSCLKCFG_OSCSRC_PIOSC  (0 << SYSCON_RSCLKCFG_OSCSRC_SHIFT) /* PIOSC is source */
#  define SYSCON_RSCLKCFG_OSCSRC_LFIOSC (1 << SYSCON_RSCLKCFG_OSCSRC_SHIFT) /* LFIOSC is source */
#  define SYSCON_RSCLKCFG_OSCSRC_MOSC   (3 << SYSCON_RSCLKCFG_OSCSRC_SHIFT) /* MOSC is source */
#  define SYSCON_RSCLKCFG_OSCSRC_RTC    (4 << SYSCON_RSCLKCFG_OSCSRC_SHIFT) /* RTCOSC is source */
#define SYSCON_RSCLKCFG_PLLSRC_SHIFT    (24)      /* Bits 24-27: PLL Source */
#define SYSCON_RSCLKCFG_PLLSRC_MASK     (15 << SYSCON_RSCLKCFG_PLLSRC_SHIFT)
#  define SYSCON_RSCLKCFG_PLLSRC_PIOSC  (0 << SYSCON_RSCLKCFG_PLLSRC_SHIFT) /* PIOSC is clock source */
#  define SYSCON_RSCLKCFG_PLLSRC_MOSC   (3 << SYSCON_RSCLKCFG_PLLSRC_SHIFT) /* MOSC is the clock source */
#define SYSCON_RSCLKCFG_USEPLL          (1 << 28) /* Bit 28: Use PLL */
#define SYSCON_RSCLKCFG_ACG             (1 << 29) /* Bit 29: Auto Clock Gating */
#define SYSCON_RSCLKCFG_NEWFREQ         (1 << 30) /* Bit 30: New PLLFREQ Accept */
#define SYSCON_RSCLKCFG_MEMTIMU         (1 << 31) /* Bit 31: Memory Timing Register Update */

/* Memory Timing Parameter Register 0 */

#define SYSCON_MEMTIM0_FWS_SHIFT       (0)       /* Bits 0-3: Flash Wait State */
#define SYSCON_MEMTIM0_FWS_MASK        (15 << SYSCON_MEMTIM0_FWS_SHIFT)
#  define SYSCON_MEMTIM0_FWS(n)        ((uint32_t)(n) << SYSCON_MEMTIM0_FWS_SHIFT)
#define SYSCON_MEMTIM0_FBCE            (1 << 5)  /* Bit 5: Flash Bank Clock Edge */
#define SYSCON_MEMTIM0_FBCHT_SHIFT     (6)       /* Bits 6-9: Flash Bank Clock High Time */
#define SYSCON_MEMTIM0_FBCHT_MASK      (15 << SYSCON_MEMTIM0_FBCHT_SHIFT)
#  define SYSCON_MEMTIM0_FBCHT_0p5     (0 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 1/2 system clock period */
#  define SYSCON_MEMTIM0_FBCHT_1       (1 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 1 system clock period */
#  define SYSCON_MEMTIM0_FBCHT_1p5     (2 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 1.5 system clock periods */
#  define SYSCON_MEMTIM0_FBCHT_2       (3 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 2 system clock periods */
#  define SYSCON_MEMTIM0_FBCHT_2p5     (4 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 2.5 system clock periods */
#  define SYSCON_MEMTIM0_FBCHT_3       (5 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 3 system clock periods */
#  define SYSCON_MEMTIM0_FBCHT_3p5     (6 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 3.5 system clock periods */
#  define SYSCON_MEMTIM0_FBCHT_4       (7 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 4 system clock periods */
#  define SYSCON_MEMTIM0_FBCHT_4p5     (8 << SYSCON_MEMTIM0_FBCHT_SHIFT) /* 4.5 system clock periods */
#define SYSCON_MEMTIM0_EWS_SHIFT       (16)      /* Bits 16-19: EEPROM Wait States */
#define SYSCON_MEMTIM0_EWS_MASK        (15 << SYSCON_MEMTIM0_EWS_SHIFT)
#  define SYSCON_MEMTIM0_EWS(n)        ((uint32_t)(n) << SYSCON_MEMTIM0_EWS_SHIFT)
#define SYSCON_MEMTIM0_EBCE            (1 << 21) /* Bit 21: EEPROM Bank Clock Edge */
#define SYSCON_MEMTIM0_EBCHT_SHIFT     (22)      /* Bits 22-25: EEPROM Clock High Time */
#define SYSCON_MEMTIM0_EBCHT_MASK      (15 << SYSCON_MEMTIM0_EBCHT_SHIFT)
#  define SYSCON_MEMTIM0_EBCHT_0p5     (0 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 1/2 system clock period */
#  define SYSCON_MEMTIM0_EBCHT_1       (1 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 1 system clock period */
#  define SYSCON_MEMTIM0_EBCHT_1p5     (2 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 1.5 system clock periods */
#  define SYSCON_MEMTIM0_EBCHT_2       (3 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 2 system clock periods */
#  define SYSCON_MEMTIM0_EBCHT_2p5     (4 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 2.5 system clock periods */
#  define SYSCON_MEMTIM0_EBCHT_3       (5 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 3 system clock periods */
#  define SYSCON_MEMTIM0_EBCHT_3p5     (6 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 3.5 system clock periods */
#  define SYSCON_MEMTIM0_EBCHT_4       (7 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 4 system clock periods */
#  define SYSCON_MEMTIM0_EBCHT_4p5     (8 << SYSCON_MEMTIM0_EBCHT_SHIFT) /* 4.5 system clock periods */

#define SYSCON_MEMTIM0_MB1             ((1 << 4) | (1 << 20)) /* Must be one */

/* Alternate Clock Configuration */

#define SYSCON_ALTCLKCFG_ALTCLK_SHIFT    (0)       /* Bits 0-3: Alternate Clock Source */
#define SYSCON_ALTCLKCFG_ALTCLK_MASK     (15 << SYSCON_ALTCLKCFG_ALTCLK_SHIFT)
#  define SYSCON_ALTCLKCFG_ALTCLK_PIOSC  (0 << SYSCON_ALTCLKCFG_ALTCLK_SHIFT) /* PIOSC */
#  define SYSCON_ALTCLKCFG_ALTCLK_RTCOSC (3 << SYSCON_ALTCLKCFG_ALTCLK_SHIFT) /* RTCOSC */
#  define SYSCON_ALTCLKCFG_ALTCLK_LFIOSC (4 << SYSCON_ALTCLKCFG_ALTCLK_SHIFT) /* LFIOSC */

/* Deep Sleep Clock Configuration Register */

#define SYSCON_DSCLKCFG_DSSYSDIV_SHIFT    (0)       /* Bits 0-9: Deep Sleep Clock Divisor */
#define SYSCON_DSCLKCFG_DSSYSDIV_MASK     (0x3ff << SYSCON_DSCLKCFG_DSSYSDIV_SHIFT)
#  define SYSCON_DSCLKCFG_DSSYSDIV(n)     ((uint32_t)(n) << SYSCON_DSCLKCFG_DSSYSDIV_SHIFT)
#define SYSCON_DSCLKCFG_DSOSCSRC_SHIFT    (20)      /* Bits 20-23: Deep Sleep Oscillator Source */
#define SYSCON_DSCLKCFG_DSOSCSRC_MASK     (15 << SYSCON_DSCLKCFG_DSOSCSRC_SHIFT)
#  define SYSCON_DSCLKCFG_DSOSCSRC_PIOSC  (0 << SYSCON_DSCLKCFG_DSOSCSRC_SHIFT) /* PIOSC */
#  define SYSCON_DSCLKCFG_DSOSCSRC_LFIOSC (2 << SYSCON_DSCLKCFG_DSOSCSRC_SHIFT) /* LFIOSC */
#  define SYSCON_DSCLKCFG_DSOSCSRC_MOSC   (3 << SYSCON_DSCLKCFG_DSOSCSRC_SHIFT) /* MOSC */
#  define SYSCON_DSCLKCFG_DSOSCSRC_RTC    (4 << SYSCON_DSCLKCFG_DSOSCSRC_SHIFT) /* RTCOSC */
#define SYSCON_DSCLKCFG_MOSCDPD           (1 << 30) /* Bit 30: MOSC Disable Power Down */
#define SYSCON_DSCLKCFG_PIOSCPD           (1 << 31) /* Bit 31: PIOSC Power Down */

